-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: project
-- ------------------------------------------------------
-- Server version	8.0.35

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `notice`
--

DROP TABLE IF EXISTS `notice`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `notice` (
  `noticeNum` int NOT NULL AUTO_INCREMENT,
  `noticeTitle` varchar(100) NOT NULL,
  `noticeContent` varchar(1000) NOT NULL,
  `noticeRegidate` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `noticeImg` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`noticeNum`)
) ENGINE=InnoDB AUTO_INCREMENT=103 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `notice`
--

LOCK TABLES `notice` WRITE;
/*!40000 ALTER TABLE `notice` DISABLE KEYS */;
INSERT INTO `notice` VALUES (1,'공지사항0','공지사항 내용0','2023-12-06 05:50:19',NULL),(2,'공지사항1','공지사항 내용1','2023-12-06 05:50:19',NULL),(3,'공지사항2','공지사항 내용2','2023-12-06 05:50:19',NULL),(4,'공지사항3','공지사항 내용3','2023-12-06 05:50:19',NULL),(5,'공지사항4','공지사항 내용4','2023-12-06 05:50:19',NULL),(6,'공지사항5','공지사항 내용5','2023-12-06 05:50:19',NULL),(7,'공지사항6','공지사항 내용6','2023-12-06 05:50:19',NULL),(8,'공지사항7','공지사항 내용7','2023-12-06 05:50:19',NULL),(9,'공지사항8','공지사항 내용8','2023-12-06 05:50:19',NULL),(10,'공지사항9','공지사항 내용9','2023-12-06 05:50:19',NULL),(11,'공지사항10','공지사항 내용10','2023-12-06 05:50:19',NULL),(12,'공지사항11','공지사항 내용11','2023-12-06 05:50:19',NULL),(13,'공지사항12','공지사항 내용12','2023-12-06 05:50:19',NULL),(14,'공지사항13','공지사항 내용13','2023-12-06 05:50:19',NULL),(15,'공지사항14','공지사항 내용14','2023-12-06 05:50:19',NULL),(16,'공지사항15','공지사항 내용15','2023-12-06 05:50:19',NULL),(17,'공지사항16','공지사항 내용16','2023-12-06 05:50:19',NULL),(18,'공지사항17','공지사항 내용17','2023-12-06 05:50:19',NULL),(19,'공지사항18','공지사항 내용18','2023-12-06 05:50:19',NULL),(20,'공지사항19','공지사항 내용19','2023-12-06 05:50:19',NULL),(21,'공지사항20','공지사항 내용20','2023-12-06 05:50:19',NULL),(22,'공지사항21','공지사항 내용21','2023-12-06 05:50:19',NULL),(23,'공지사항22','공지사항 내용22','2023-12-06 05:50:19',NULL),(24,'공지사항23','공지사항 내용23','2023-12-06 05:50:19',NULL),(25,'공지사항24','공지사항 내용24','2023-12-06 05:50:19',NULL),(26,'공지사항25','공지사항 내용25','2023-12-06 05:50:19',NULL),(27,'공지사항26','공지사항 내용26','2023-12-06 05:50:19',NULL),(28,'공지사항27','공지사항 내용27','2023-12-06 05:50:19',NULL),(29,'공지사항28','공지사항 내용28','2023-12-06 05:50:19',NULL),(30,'공지사항29','공지사항 내용29','2023-12-06 05:50:19',NULL),(31,'공지사항30','공지사항 내용30','2023-12-06 05:50:19',NULL),(32,'공지사항31','공지사항 내용31','2023-12-06 05:50:19',NULL),(33,'공지사항32','공지사항 내용32','2023-12-06 05:50:19',NULL),(34,'공지사항33','공지사항 내용33','2023-12-06 05:50:19',NULL),(35,'공지사항34','공지사항 내용34','2023-12-06 05:50:19',NULL),(36,'공지사항35','공지사항 내용35','2023-12-06 05:50:19',NULL),(37,'공지사항36','공지사항 내용36','2023-12-06 05:50:19',NULL),(38,'공지사항37','공지사항 내용37','2023-12-06 05:50:19',NULL),(39,'공지사항38','공지사항 내용38','2023-12-06 05:50:19',NULL),(40,'공지사항39','공지사항 내용39','2023-12-06 05:50:19',NULL),(41,'공지사항40','공지사항 내용40','2023-12-06 05:50:19',NULL),(42,'공지사항41','공지사항 내용41','2023-12-06 05:50:19',NULL),(43,'공지사항42','공지사항 내용42','2023-12-06 05:50:19',NULL),(44,'공지사항43','공지사항 내용43','2023-12-06 05:50:19',NULL),(45,'공지사항44','공지사항 내용44','2023-12-06 05:50:19',NULL),(46,'공지사항45','공지사항 내용45','2023-12-06 05:50:19',NULL),(47,'공지사항46','공지사항 내용46','2023-12-06 05:50:19',NULL),(48,'공지사항47','공지사항 내용47','2023-12-06 05:50:19',NULL),(49,'공지사항48','공지사항 내용48','2023-12-06 05:50:19',NULL),(50,'공지사항49','공지사항 내용49','2023-12-06 05:50:19',NULL),(51,'공지사항50','공지사항 내용50','2023-12-06 05:50:19',NULL),(52,'공지사항51','공지사항 내용51','2023-12-06 05:50:19',NULL),(53,'공지사항52','공지사항 내용52','2023-12-06 05:50:19',NULL),(54,'공지사항53','공지사항 내용53','2023-12-06 05:50:19',NULL),(55,'공지사항54','공지사항 내용54','2023-12-06 05:50:19',NULL),(56,'공지사항55','공지사항 내용55','2023-12-06 05:50:19',NULL),(57,'공지사항56','공지사항 내용56','2023-12-06 05:50:19',NULL),(58,'공지사항57','공지사항 내용57','2023-12-06 05:50:19',NULL),(59,'공지사항58','공지사항 내용58','2023-12-06 05:50:19',NULL),(60,'공지사항59','공지사항 내용59','2023-12-06 05:50:19',NULL),(61,'공지사항60','공지사항 내용60','2023-12-06 05:50:19',NULL),(62,'공지사항61','공지사항 내용61','2023-12-06 05:50:19',NULL),(63,'공지사항62','공지사항 내용62','2023-12-06 05:50:19',NULL),(64,'공지사항63','공지사항 내용63','2023-12-06 05:50:19',NULL),(65,'공지사항64','공지사항 내용64','2023-12-06 05:50:19',NULL),(66,'공지사항65','공지사항 내용65','2023-12-06 05:50:19',NULL),(67,'공지사항66','공지사항 내용66','2023-12-06 05:50:19',NULL),(68,'공지사항67','공지사항 내용67','2023-12-06 05:50:19',NULL),(69,'공지사항68','공지사항 내용68','2023-12-06 05:50:19',NULL),(70,'공지사항69','공지사항 내용69','2023-12-06 05:50:19',NULL),(71,'공지사항70','공지사항 내용70','2023-12-06 05:50:19',NULL),(72,'공지사항71','공지사항 내용71','2023-12-06 05:50:19',NULL),(73,'공지사항72','공지사항 내용72','2023-12-06 05:50:19',NULL),(74,'공지사항73','공지사항 내용73','2023-12-06 05:50:19',NULL),(75,'공지사항74','공지사항 내용74','2023-12-06 05:50:19',NULL),(76,'공지사항75','공지사항 내용75','2023-12-06 05:50:19',NULL),(77,'공지사항76','공지사항 내용76','2023-12-06 05:50:19',NULL),(78,'공지사항77','공지사항 내용77','2023-12-06 05:50:19',NULL),(79,'공지사항78','공지사항 내용78','2023-12-06 05:50:19',NULL),(80,'공지사항79','공지사항 내용79','2023-12-06 05:50:19',NULL),(81,'공지사항80','공지사항 내용80','2023-12-06 05:50:19',NULL),(82,'공지사항81','공지사항 내용81','2023-12-06 05:50:19',NULL),(83,'공지사항82','공지사항 내용82','2023-12-06 05:50:19',NULL),(84,'공지사항83','공지사항 내용83','2023-12-06 05:50:19',NULL),(85,'공지사항84','공지사항 내용84','2023-12-06 05:50:19',NULL),(86,'공지사항85','공지사항 내용85','2023-12-06 05:50:19',NULL),(87,'공지사항86','공지사항 내용86','2023-12-06 05:50:19',NULL),(88,'공지사항87','공지사항 내용87','2023-12-06 05:50:19',NULL),(89,'공지사항88','공지사항 내용88','2023-12-06 05:50:19',NULL),(90,'공지사항89','공지사항 내용89','2023-12-06 05:50:19',NULL),(91,'공지사항90','공지사항 내용90','2023-12-06 05:50:19',NULL),(92,'공지사항91','공지사항 내용91','2023-12-06 05:50:19',NULL),(93,'공지사항92','공지사항 내용92','2023-12-06 05:50:19',NULL),(94,'공지사항93','공지사항 내용93','2023-12-06 05:50:19',NULL),(95,'공지사항94','공지사항 내용94','2023-12-06 05:50:19',NULL),(96,'공지사항95','공지사항 내용95','2023-12-06 05:50:19',NULL),(97,'공지사항96','공지사항 내용96','2023-12-06 05:50:19',NULL),(98,'공지사항97','공지사항 내용97','2023-12-06 05:50:19',NULL),(99,'공지사항98','공지사항 내용98','2023-12-06 05:50:19',NULL),(100,'공지사항99','공지사항 내용99','2023-12-06 05:50:19',NULL),(101,'공지사항100','공지사항 내용100','2023-12-06 05:50:19',NULL),(102,'공지사항 추추가','공지사항 추가합니다다다다...','2023-12-06 06:39:56','/img/20231206-153956-743-2.jpg');
/*!40000 ALTER TABLE `notice` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-01-04 12:41:09
